In [1]:
pip install pandas

Requirement already satisfied: pandas in c:\users\chini\anaconda3\lib\site-packages (2.0.3)
Requirement already satisfied: python-dateutil>=2.8.2 in c:\users\chini\anaconda3\lib\site-packages (from pandas) (2.8.2)
Requirement already satisfied: pytz>=2020.1 in c:\users\chini\anaconda3\lib\site-packages (from pandas) (2023.3.post1)
Requirement already satisfied: tzdata>=2022.1 in c:\users\chini\anaconda3\lib\site-packages (from pandas) (2023.3)
Requirement already satisfied: numpy>=1.21.0 in c:\users\chini\anaconda3\lib\site-packages (from pandas) (1.24.3)
Requirement already satisfied: six>=1.5 in c:\users\chini\anaconda3\lib\site-packages (from python-dateutil>=2.8.2->pandas) (1.16.0)
Note: you may need to restart the kernel to use updated packages.

In [2]:
import pandas as pd

## Creating DataFrame

In [3]:
mylist = ["banana", "apple", "cherry"]

pd.DataFrame(mylist)

        0
0  banana
1   apple
2  cherry

In [4]:
mylist2 = [1,2,3], [4,5,6]

pd.DataFrame(mylist2)

   0  1  2
0  1  2  3
1  4  5  6

In [5]:
data = {
"calories" : [420,380,390],
"duration" : [50,40,45]}

pd.DataFrame(data)

   calories  duration
0       420        50
1       380        40
2       390        45

## Read CSV Files

In [13]:
df = pd.read_csv("student (1).csv")
df

    id         name  class  mark  gender
0    1     John Deo   Four    75  female
1    2     Max Ruin  Three    85    male
2    3       Arnold  Three    55    male
3    4   Krish Star   Four    60  female
4    5    John Mike   Four    60  female
5    6    Alex John   Four    55    male
6    7  My John Rob  Fifth    78    male
7    8       Asruid   Five    85    male
8    9      Tes Qry    Six    78    male
9   10     Big John   Four    55  female
10  11       Ronald    Six    89  female
11  12        Recky    Six    94  female
12  13          Kty  Seven    88  female
13  14         Bigy    NaN    88  female
14  15     Tade Row   Four    88     NaN
15  16        Gimmy   Four    88    male
16  17        Tumyu    Six    54    male
17  18        Honny   Five    75    male
18  19        Tinny   Nine    18    male
19  20       Jackly   Nine    65     NaN
20  21   Babby John   Four    69  female
21  22       Reggid  Seven    55  female
22  23        Herod    NaN    79    male
23  24    Tiddy Now  Seven    78    male
24  25     Giff Tow  Seven    88    male
25  26       Crelea  Seven    79    male
26  27     Big Nose  Three    81  female
27  28    Rojj Base  Seven    86  female
28  29          NaN  Seven    55    male
29  30    Reppy Red    Six    79  female
30  31  Marry Toeey   Four    88    male
31  32    Binn Rott  Seven    90  female
32  33    Kenn Rein    Six    96  female
33  34     Gain Toe  Seven    69    male
34  35   Rows Noump    Six    88  female

In [14]:
df.shape

(35, 5)

In [15]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 35 entries, 0 to 34
Data columns (total 5 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   id      35 non-null     int64
 1   name    34 non-null     object
 2   class   33 non-null     object
 3   mark    35 non-null     int64
 4   gender  33 non-null     object
dtypes: int64(2), object(3)
memory usage: 1.5+ KB

In [16]:
df.dtypes

id         int64
name      object
class     object
mark       int64
gender    object
dtype: object

In [17]:
df.describe()

              id       mark
count  35.000000  35.000000
mean   18.000000  74.657143
std    10.246951  16.401117
min     1.000000  18.000000
25%     9.500000  62.500000
50%    18.000000  79.000000
75%    26.500000  88.000000
max    35.000000  96.000000

In [19]:
df.mark.mean()

74.65714285714286

In [22]:
df.name

0        John Deo
1        Max Ruin
2          Arnold
3      Krish Star
4       John Mike
5       Alex John
6     My John Rob
7          Asruid
8         Tes Qry
9        Big John
10         Ronald
11          Recky
12            Kty
13           Bigy
14       Tade Row
15          Gimmy
16          Tumyu
17          Honny
18          Tinny
19         Jackly
20     Babby John
21         Reggid
22          Herod
23      Tiddy Now
24       Giff Tow
25         Crelea
26       Big Nose
27      Rojj Base
28            NaN
29      Reppy Red
30    Marry Toeey
31      Binn Rott
32      Kenn Rein
33       Gain Toe
34     Rows Noump
Name: name, dtype: object

In [23]:
df.name[0]

'John Deo'

In [25]:
df["class"].value_counts()

class
Four     9
Seven    9
Six      7
Three    3
Five     2
Nine     2
Fifth    1
Name: count, dtype: int64

In [26]:
df["gender"].value_counts()

gender
male      17
female    16
Name: count, dtype: int64

In [27]:
df["mark"].value_counts()

mark
88    7
55    5
78    3
79    3
75    2
69    2
60    2
85    2
90    1
86    1
81    1
54    1
65    1
18    1
94    1
89    1
96    1
Name: count, dtype: int64

In [28]:
df.head()

   id        name  class  mark  gender
0   1    John Deo   Four    75  female
1   2    Max Ruin  Three    85    male
2   3      Arnold  Three    55    male
3   4  Krish Star   Four    60  female
4   5   John Mike   Four    60  female

In [29]:
df.head(3)

   id      name  class  mark  gender
0   1  John Deo   Four    75  female
1   2  Max Ruin  Three    85    male
2   3    Arnold  Three    55    male

In [30]:
df.tail()

    id         name  class  mark  gender
30  31  Marry Toeey   Four    88    male
31  32    Binn Rott  Seven    90  female
32  33    Kenn Rein    Six    96  female
33  34     Gain Toe  Seven    69    male
34  35   Rows Noump    Six    88  female

In [31]:
df.tail(3)

    id        name  class  mark  gender
32  33   Kenn Rein    Six    96  female
33  34    Gain Toe  Seven    69    male
34  35  Rows Noump    Six    88  female

In [34]:
df.sample()

    id       name  class  mark gender
23  24  Tiddy Now  Seven    78   male

In [35]:
df.sample(5)

    id         name  class  mark  gender
6    7  My John Rob  Fifth    78    male
30  31  Marry Toeey   Four    88    male
1    2     Max Ruin  Three    85    male
14  15     Tade Row   Four    88     NaN
31  32    Binn Rott  Seven    90  female

In [36]:
df.name.sample(5)

22        Herod
4     John Mike
26     Big Nose
33     Gain Toe
25       Crelea
Name: name, dtype: object

In [37]:
df.gender.head()

0    female
1      male
2      male
3    female
4    female
Name: gender, dtype: object

In [39]:
df[["name", "class"]].sample(3)

         name class
0    John Deo  Four
19     Jackly  Nine
4   John Mike  Four

## doc and iloc

In [40]:
df.loc[1:3, "name"]

1      Max Ruin
2        Arnold
3    Krish Star
Name: name, dtype: object

In [41]:
df.iloc[1]

id               2
name      Max Ruin
class        Three
mark            85
gender        male
Name: 1, dtype: object

In [42]:
df.loc[1]

id               2
name      Max Ruin
class        Three
mark            85
gender        male
Name: 1, dtype: object

In [46]:
df.iloc[1:4, 1]

1      Max Ruin
2        Arnold
3    Krish Star
Name: name, dtype: object

In [45]:
df.head()

   id        name  class  mark  gender
0   1    John Deo   Four    75  female
1   2    Max Ruin  Three    85    male
2   3      Arnold  Three    55    male
3   4  Krish Star   Four    60  female
4   5   John Mike   Four    60  female

In [48]:
df.loc[2:5, ["name", "gender"]]

         name  gender
2      Arnold    male
3  Krish Star  female
4   John Mike  female
5   Alex John    male

In [50]:
df.iloc[2:6,[1,4]]

         name  gender
2      Arnold    male
3  Krish Star  female
4   John Mike  female
5   Alex John    male

## Filtering Data in Pandas

In [51]:
df.head()

   id        name  class  mark  gender
0   1    John Deo   Four    75  female
1   2    Max Ruin  Three    85    male
2   3      Arnold  Three    55    male
3   4  Krish Star   Four    60  female
4   5   John Mike   Four    60  female

In [52]:
df["mark"]< 50

0     False
1     False
2     False
3     False
4     False
5     False
6     False
7     False
8     False
9     False
10    False
11    False
12    False
13    False
14    False
15    False
16    False
17    False
18     True
19    False
20    False
21    False
22    False
23    False
24    False
25    False
26    False
27    False
28    False
29    False
30    False
31    False
32    False
33    False
34    False
Name: mark, dtype: bool

In [53]:
df[df["mark"]<50]

    id   name class  mark gender
18  19  Tinny  Nine    18   male

In [54]:
df.loc[df["mark"]<50]

    id   name class  mark gender
18  19  Tinny  Nine    18   male

In [59]:
df[df["class"]  == "Six"]

    id        name class  mark  gender
8    9     Tes Qry   Six    78    male
10  11      Ronald   Six    89  female
11  12       Recky   Six    94  female
16  17       Tumyu   Six    54    male
29  30   Reppy Red   Six    79  female
32  33   Kenn Rein   Six    96  female
34  35  Rows Noump   Six    88  female

In [60]:
df[df["class"]  == "Six"].name

8        Tes Qry
10        Ronald
11         Recky
16         Tumyu
29     Reppy Red
32     Kenn Rein
34    Rows Noump
Name: name, dtype: object

In [61]:
df.loc[df["class"]=="Six", "name"]

8        Tes Qry
10        Ronald
11         Recky
16         Tumyu
29     Reppy Red
32     Kenn Rein
34    Rows Noump
Name: name, dtype: object

In [62]:
df.loc[df["class"]=="Six", ["name", "class"]]

          name class
8      Tes Qry   Six
10      Ronald   Six
11       Recky   Six
16       Tumyu   Six
29   Reppy Red   Six
32   Kenn Rein   Six
34  Rows Noump   Six

In [63]:
df[df["class"] == "Six"][["name","class"]]

          name class
8      Tes Qry   Six
10      Ronald   Six
11       Recky   Six
16       Tumyu   Six
29   Reppy Red   Six
32   Kenn Rein   Six
34  Rows Noump   Six

In [64]:
df.head()

   id        name  class  mark  gender
0   1    John Deo   Four    75  female
1   2    Max Ruin  Three    85    male
2   3      Arnold  Three    55    male
3   4  Krish Star   Four    60  female
4   5   John Mike   Four    60  female

In [65]:
df[df["mark"] > 80]

    id         name  class  mark  gender
1    2     Max Ruin  Three    85    male
7    8       Asruid   Five    85    male
10  11       Ronald    Six    89  female
11  12        Recky    Six    94  female
12  13          Kty  Seven    88  female
13  14         Bigy    NaN    88  female
14  15     Tade Row   Four    88     NaN
15  16        Gimmy   Four    88    male
24  25     Giff Tow  Seven    88    male
26  27     Big Nose  Three    81  female
27  28    Rojj Base  Seven    86  female
30  31  Marry Toeey   Four    88    male
31  32    Binn Rott  Seven    90  female
32  33    Kenn Rein    Six    96  female
34  35   Rows Noump    Six    88  female

In [67]:
df[df["mark"] > 80].count()

id        15
name      15
class     14
mark      15
gender    14
dtype: int64

In [68]:
df.name[df["mark"] > 80].count()

15

In [74]:
df[(df["mark"]>80) & (df["gender"]=="female")]

    id        name  class  mark  gender
10  11      Ronald    Six    89  female
11  12       Recky    Six    94  female
12  13         Kty  Seven    88  female
13  14        Bigy    NaN    88  female
26  27    Big Nose  Three    81  female
27  28   Rojj Base  Seven    86  female
31  32   Binn Rott  Seven    90  female
32  33   Kenn Rein    Six    96  female
34  35  Rows Noump    Six    88  female

In [78]:
df[(df["mark"]>80) & (df["gender"]=="female") & (df["class"] == "Three")]

    id      name  class  mark  gender
26  27  Big Nose  Three    81  female

In [80]:
df.mean

<bound method NDFrame._add_numeric_operations.<locals>.mean of     id         name  class  mark  gender
0    1     John Deo   Four    75  female
1    2     Max Ruin  Three    85    male
2    3       Arnold  Three    55    male
3    4   Krish Star   Four    60  female
4    5    John Mike   Four    60  female
5    6    Alex John   Four    55    male
6    7  My John Rob  Fifth    78    male
7    8       Asruid   Five    85    male
8    9      Tes Qry    Six    78    male
9   10     Big John   Four    55  female
10  11       Ronald    Six    89  female
11  12        Recky    Six    94  female
12  13          Kty  Seven    88  female
13  14         Bigy    NaN    88  female
14  15     Tade Row   Four    88     NaN
15  16        Gimmy   Four    88    male
16  17        Tumyu    Six    54    male
17  18        Honny   Five    75    male
18  19        Tinny   Nine    18    male
19  20       Jackly   Nine    65     NaN
20  21   Babby John   Four    69  female
21  22       Reggid  Seven    55  female
22  23        Herod    NaN    79    male
23  24    Tiddy Now  Seven    78    male
24  25     Giff Tow  Seven    88    male
25  26       Crelea  Seven    79    male
26  27     Big Nose  Three    81  female
27  28    Rojj Base  Seven    86  female
28  29          NaN  Seven    55    male
29  30    Reppy Red    Six    79  female
30  31  Marry Toeey   Four    88    male
31  32    Binn Rott  Seven    90  female
32  33    Kenn Rein    Six    96  female
33  34     Gain Toe  Seven    69    male
34  35   Rows Noump    Six    88  female>

In [82]:
df.mark.mean()

74.65714285714286

In [86]:
df[df["mark"] > df.mark.mean()]

    id         name  class  mark  gender
0    1     John Deo   Four    75  female
1    2     Max Ruin  Three    85    male
6    7  My John Rob  Fifth    78    male
7    8       Asruid   Five    85    male
8    9      Tes Qry    Six    78    male
10  11       Ronald    Six    89  female
11  12        Recky    Six    94  female
12  13          Kty  Seven    88  female
13  14         Bigy    NaN    88  female
14  15     Tade Row   Four    88     NaN
15  16        Gimmy   Four    88    male
17  18        Honny   Five    75    male
22  23        Herod    NaN    79    male
23  24    Tiddy Now  Seven    78    male
24  25     Giff Tow  Seven    88    male
25  26       Crelea  Seven    79    male
26  27     Big Nose  Three    81  female
27  28    Rojj Base  Seven    86  female
29  30    Reppy Red    Six    79  female
30  31  Marry Toeey   Four    88    male
31  32    Binn Rott  Seven    90  female
32  33    Kenn Rein    Six    96  female
34  35   Rows Noump    Six    88  female

In [97]:
df[df["mark"] > df.mark.mean()].id.count()

23

## Missing Values

In [98]:
df.isnull()

       id   name  class   mark  gender
0   False  False  False  False   False
1   False  False  False  False   False
2   False  False  False  False   False
3   False  False  False  False   False
4   False  False  False  False   False
5   False  False  False  False   False
6   False  False  False  False   False
7   False  False  False  False   False
8   False  False  False  False   False
9   False  False  False  False   False
10  False  False  False  False   False
11  False  False  False  False   False
12  False  False  False  False   False
13  False  False   True  False   False
14  False  False  False  False    True
15  False  False  False  False   False
16  False  False  False  False   False
17  False  False  False  False   False
18  False  False  False  False   False
19  False  False  False  False    True
20  False  False  False  False   False
21  False  False  False  False   False
22  False  False   True  False   False
23  False  False  False  False   False
24  False  False  False  False   False
25  False  False  False  False   False
26  False  False  False  False   False
27  False  False  False  False   False
28  False   True  False  False   False
29  False  False  False  False   False
30  False  False  False  False   False
31  False  False  False  False   False
32  False  False  False  False   False
33  False  False  False  False   False
34  False  False  False  False   False

In [100]:
df.isnull().sum()

id        0
name      1
class     2
mark      0
gender    2
dtype: int64

In [101]:
df.isnull().sum().sum()

5

In [105]:
df.shape

(35, 5)

In [102]:
df[df.isnull().any(axis=1)]

    id      name  class  mark  gender
13  14      Bigy    NaN    88  female
14  15  Tade Row   Four    88     NaN
19  20    Jackly   Nine    65     NaN
22  23     Herod    NaN    79    male
28  29       NaN  Seven    55    male

In [104]:
df.dropna()

    id         name  class  mark  gender
0    1     John Deo   Four    75  female
1    2     Max Ruin  Three    85    male
2    3       Arnold  Three    55    male
3    4   Krish Star   Four    60  female
4    5    John Mike   Four    60  female
5    6    Alex John   Four    55    male
6    7  My John Rob  Fifth    78    male
7    8       Asruid   Five    85    male
8    9      Tes Qry    Six    78    male
9   10     Big John   Four    55  female
10  11       Ronald    Six    89  female
11  12        Recky    Six    94  female
12  13          Kty  Seven    88  female
15  16        Gimmy   Four    88    male
16  17        Tumyu    Six    54    male
17  18        Honny   Five    75    male
18  19        Tinny   Nine    18    male
20  21   Babby John   Four    69  female
21  22       Reggid  Seven    55  female
23  24    Tiddy Now  Seven    78    male
24  25     Giff Tow  Seven    88    male
25  26       Crelea  Seven    79    male
26  27     Big Nose  Three    81  female
27  28    Rojj Base  Seven    86  female
29  30    Reppy Red    Six    79  female
30  31  Marry Toeey   Four    88    male
31  32    Binn Rott  Seven    90  female
32  33    Kenn Rein    Six    96  female
33  34     Gain Toe  Seven    69    male
34  35   Rows Noump    Six    88  female

In [107]:
df.dropna().shape

(30, 5)

In [109]:
df.dropna(inplace=True)

In [111]:
df.isnull().sum()

id        0
name      0
class     0
mark      0
gender    0
dtype: int64